"""
Определите класс Person, в котором определите свойства (динамические переменные) name и birth_date, метод get_year,
который будет private (использовать инкапсуляцию), а также метод show, который будет возвращать строку с именем и годом рождения
(внутри использовать для получение года метод get_year)

name - это имя, тип str
birth_date - это дата рождения, тип str
метод get_year на основании даты рождения получает год рождения, возвращаемое значение типа тип int
метод show - получение строки с информацией о человеке, возвращаемое значение типа str
Пример возвращаемой строки методом show при name='Anna' и birth_date='01-01-1993':

'Name = Anna and year of birth = 1993' (обратите внимание на пробелы между знаками)

 

После определения класса определите объект класса (экземпляра класса), закрепив за ним название переменной person,
в качестве аргументов подайте следующие значения:

name='Fedor'
birth_date='01-01-2002'
Переменной result присвойте вызов метода show экземпляра класса  person.

 

Примечание:

Для того, чтобы получить год из строки с датой, воспользуйтесь методом в уроке "Переменные и типы данных" на 2 шаге.
Полученное значение года рождения должно быть по итогу типа int.
"""

class Person:
    def __init__(self, name: str, birth_date: str):
        self.name = name
        self.birth_date = birth_date
        
    def __get_year(self) -> int:
        return int(self.birth_date[6:])
    
    def show(self) -> str:
        return f'Name = {self.name} and year of birth = {self.__get_year()}'
        
        
person = Person(name='Fedor', birth_date='01-01-2002')
result = person.show()
